knieriem/tinygo-stm32-svd/svd/stm32u5a9.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="DMA2D">
      <name>SEC_DMA2D</name>
      <baseAddress>0x5002B000</baseAddress>
    </peripheral>
    <peripheral>
      <name>DSI</name>
      <description>DSI</description>
      <groupName>DSI</groupName>
      <baseAddress>0x40016C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DSIHOST</name>
        <description>DSI global interrupt</description>
        <value>137</value>
      </interrupt>
      <registers>
        <register>
          <name>VR</name>
          <displayName>VR</displayName>
          <description>DSI Host version register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x3134312A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version of the DSI Host
This read-only register contains the version of the DSI Host</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>DSI Host control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable
This bit configures the DSI Host in either power-up mode or to reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>DSI Host clock control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXECKDIV</name>
              <description>TX escape clock division
This field indicates the division factor for the TX escape clock source (lanebyteclk). The values 0 and 1 stop the TX_ESC clock generation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOCKDIV</name>
              <description>Timeout clock division
This field indicates the division factor for the timeout clock used as the timing unit in the configuration of HS to LP and LP to HS transition error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVCIDR</name>
          <displayName>LVCIDR</displayName>
          <description>DSI Host LTDC VCID register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VCID</name>
              <description>Virtual channel ID
These bits configure the virtual channel ID for the LTDC interface traffic.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCOLCR</name>
          <displayName>LCOLCR</displayName>
          <description>DSI Host LTDC color coding register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COLC</name>
              <description>Color coding
This field configures the DPI color coding.
Others: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPE</name>
              <description>Loosely packet enable
This bit enables the loosely packed variant to 18-bit configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCR</name>
          <displayName>LPCR</displayName>
          <description>DSI Host LTDC polarity configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEP</name>
              <description>Data enable polarity
This bit configures the polarity of data enable pin.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSP</name>
              <description>VSYNC polarity
This bit configures the polarity of VSYNC pin.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSP</name>
              <description>HSYNC polarity
This bit configures the polarity of HSYNC pin.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMCR</name>
          <displayName>LPMCR</displayName>
          <description>DSI Host low-power mode configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VLPSIZE</name>
              <description>VACT largest packet size
This field is used for the transmission of commands in low-power mode. It defines the size, in bytes, of the largest packet that can fit in a line during VACT regions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPSIZE</name>
              <description>Largest packet size
This field is used for the transmission of commands in low-power mode. It defines the size, in bytes, of the largest packet that can fit in a line during VSA, VBP and VFP regions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR</name>
          <displayName>PCR</displayName>
          <description>DSI Host protocol configuration register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ETTXE</name>
              <description>EoTp transmission enable
This bit enables the EoTP transmission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETRXE</name>
              <description>EoTp reception enable
This bit enables the EoTp reception.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTAE</name>
              <description>Bus-turn-around enable
This bit enables the bus-turn-around (BTA) request.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCRXE</name>
              <description>ECC reception enable
This bit enables the ECC reception, error correction and reporting.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCRXE</name>
              <description>CRC reception enable
This bit enables the CRC reception and error reporting.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETTXLPE</name>
              <description>EoTp transmission in low-power enable
This bit enables the EoTP transmission in low-power.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GVCIDR</name>
          <displayName>GVCIDR</displayName>
          <description>DSI Host generic VCID register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VCIDRX</name>
              <description>Virtual channel ID for reception
This field indicates the generic interface read-back virtual channel identification.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCIDTX</name>
              <description>Virtual channel ID for transmission
This field indicates the generic interface virtual channel identification where the generic packet is automatically generated and transmitted.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <displayName>MCR</displayName>
          <description>DSI Host mode configuration register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDM</name>
              <description>Command mode
This bit configures the DSI Host in either video or command mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMCR</name>
          <displayName>VMCR</displayName>
          <description>DSI Host video mode configuration register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VMT</name>
              <description>Video mode type
This field configures the video mode transmission type :
1x: Burst mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPVSAE</name>
              <description>Low-power vertical sync active enable
This bit enables to return to low-power inside the vertical sync time (VSA) period when timing allows.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPVBPE</name>
              <description>Low-power vertical back-porch enable
This bit enables to return to low-power inside the vertical back-porch (VBP) period when timing allows.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPVFPE</name>
              <description>Low-power vertical front-porch enable
This bit enables to return to low-power inside the vertical front-porch (VFP) period when timing allows.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPVAE</name>
              <description>Low-power vertical active enable
This bit enables to return to low-power inside the vertical active (VACT) period when timing allows.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPHBPE</name>
              <description>Low-power horizontal back-porch enable
This bit enables the return to low-power inside the horizontal back-porch (HBP) period when timing allows.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPHFPE</name>
              <description>Low-power horizontal front-porch enable
This bit enables the return to low-power inside the horizontal front-porch (HFP) period when timing allows.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FBTAAE</name>
              <description>Frame bus-turn-around acknowledge enable
This bit enables the request for an acknowledge response at the end of a frame.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCE</name>
              <description>Low-power command enable
This bit enables the command transmission only in low-power mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGE</name>
              <description>Pattern generator enable
This bit enables the video mode pattern generator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGM</name>
              <description>Pattern generator mode
This bit configures the pattern generator mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGO</name>
              <description>Pattern generator orientation
This bit configures the color bar orientation.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VPCR</name>
          <displayName>VPCR</displayName>
          <description>DSI Host video packet configuration register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VPSIZE</name>
              <description>Video packet size
This field configures the number of pixels in a single video packet.
For 18-bit not loosely packed data types, this number must be a multiple of 4.
For YCbCr data types, it must be a multiple of 2 as described in the DSI specification.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCCR</name>
          <displayName>VCCR</displayName>
          <description>DSI Host video chunks configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUMC</name>
              <description>Number of chunks
This register configures the number of chunks to be transmitted during a line period (a chunk consists of a video packet and a null packet).
If set to 0 or 1, the video line is transmitted in a single packet.
If set to 1, the packet is part of a chunk, so a null packet follows it if NPSIZE &gt; 0. Otherwise, multiple chunks are used to transmit each video line.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VNPCR</name>
          <displayName>VNPCR</displayName>
          <description>DSI Host video null packet configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPSIZE</name>
              <description>Null packet size
This field configures the number of bytes inside a null packet.
Setting to 0 disables the null packets.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VHSACR</name>
          <displayName>VHSACR</displayName>
          <description>DSI Host video HSA configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSA</name>
              <description>Horizontal synchronism active duration
This fields configures the horizontal synchronism active period in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VHBPCR</name>
          <displayName>VHBPCR</displayName>
          <description>DSI Host video HBP configuration register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HBP</name>
              <description>Horizontal back-porch duration
This fields configures the horizontal back-porch period in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VLCR</name>
          <displayName>VLCR</displayName>
          <description>DSI Host video line configuration register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HLINE</name>
              <description>Horizontal line duration
This fields configures the total of the horizontal line period (HSA+HBP+HACT+HFP) counted in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VVSACR</name>
          <displayName>VVSACR</displayName>
          <description>DSI Host video VSA configuration register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSA</name>
              <description>Vertical synchronism active duration
This fields configures the vertical synchronism active period measured in number of horizontal lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VVBPCR</name>
          <displayName>VVBPCR</displayName>
          <description>DSI Host video VBP configuration register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBP</name>
              <description>Vertical back-porch duration
This fields configures the vertical back-porch period measured in number of horizontal lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VVFPCR</name>
          <displayName>VVFPCR</displayName>
          <description>DSI Host video VFP configuration register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VFP</name>
              <description>Vertical front-porch duration
This fields configures the vertical front-porch period measured in number of horizontal lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
