knieriem/tinygo-stm32-svd/svd/stm32u5a9.svd
        <register>
          <name>IER0</name>
          <displayName>IER0</displayName>
          <description>DSI Host interrupt enable register 0</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AE0IE</name>
              <description>Acknowledge error 0 interrupt enable
This bit enables the interrupt generation on acknowledge error 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE1IE</name>
              <description>Acknowledge error 1 interrupt enable
This bit enables the interrupt generation on acknowledge error 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE2IE</name>
              <description>Acknowledge error 2 interrupt enable
This bit enables the interrupt generation on acknowledge error 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE3IE</name>
              <description>Acknowledge error 3 interrupt enable
This bit enables the interrupt generation on acknowledge error 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE4IE</name>
              <description>Acknowledge error 4 interrupt enable
This bit enables the interrupt generation on acknowledge error 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE5IE</name>
              <description>Acknowledge error 5 interrupt enable
This bit enables the interrupt generation on acknowledge error 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE6IE</name>
              <description>Acknowledge error 6 interrupt enable
This bit enables the interrupt generation on acknowledge error 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE7IE</name>
              <description>Acknowledge error 7 interrupt enable
This bit enables the interrupt generation on acknowledge error 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE8IE</name>
              <description>Acknowledge error 8 interrupt enable
This bit enables the interrupt generation on acknowledge error 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE9IE</name>
              <description>Acknowledge error 9 interrupt enable
This bit enables the interrupt generation on acknowledge error 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE10IE</name>
              <description>Acknowledge error 10 interrupt enable
This bit enables the interrupt generation on acknowledge error 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE11IE</name>
              <description>Acknowledge error 11 interrupt enable
This bit enables the interrupt generation on acknowledge error 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE12IE</name>
              <description>Acknowledge error 12 interrupt enable
This bit enables the interrupt generation on acknowledge error 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE13IE</name>
              <description>Acknowledge error 13 interrupt enable
This bit enables the interrupt generation on acknowledge error 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE14IE</name>
              <description>Acknowledge error 14 interrupt enable
This bit enables the interrupt generation on acknowledge error 14.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE15IE</name>
              <description>Acknowledge error 15 interrupt enable
This bit enables the interrupt generation on acknowledge error 15.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE0IE</name>
              <description>PHY error 0 interrupt enable
This bit enables the interrupt generation on PHY error 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE1IE</name>
              <description>PHY error 1 interrupt enable
This bit enables the interrupt generation on PHY error 1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE2IE</name>
              <description>PHY error 2 interrupt enable
This bit enables the interrupt generation on PHY error 2.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE3IE</name>
              <description>PHY error 3 interrupt enable
This bit enables the interrupt generation on PHY error 4.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE4IE</name>
              <description>PHY error 4 interrupt enable
This bit enables the interrupt generation on PHY error 4.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER1</name>
          <displayName>IER1</displayName>
          <description>DSI Host interrupt enable register 1</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOHSTXIE</name>
              <description>Timeout high-speed transmission interrupt enable
This bit enables the interrupt generation on timeout high-speed transmission .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOLPRXIE</name>
              <description>Timeout low-power reception interrupt enable
This bit enables the interrupt generation on timeout low-power reception.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCSEIE</name>
              <description>ECC single-bit error interrupt enable
This bit enables the interrupt generation on ECC single-bit error.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCMEIE</name>
              <description>ECC multi-bit error interrupt enable
This bit enables the interrupt generation on ECC multi-bit error.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCEIE</name>
              <description>CRC error interrupt enable
This bit enables the interrupt generation on CRC error.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEIE</name>
              <description>Packet size error interrupt enable
This bit enables the interrupt generation on packet size error.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOTPEIE</name>
              <description>EoTp error interrupt enable
This bit enables the interrupt generation on EoTp error.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPWREIE</name>
              <description>LTDC payload write error interrupt enable
This bit enables the interrupt generation on LTDC payload write error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GCWREIE</name>
              <description>Generic command write error interrupt enable
This bit enables the interrupt generation on generic command write error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPWREIE</name>
              <description>Generic payload write error interrupt enable
This bit enables the interrupt generation on generic payload write error.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTXEIE</name>
              <description>Generic payload transmit error interrupt enable
This bit enables the interrupt generation on generic payload transmit error.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPRDEIE</name>
              <description>Generic payload read error interrupt enable
This bit enables the interrupt generation on generic payload read error.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPRXEIE</name>
              <description>Generic payload receive error interrupt enable
This bit enables the interrupt generation on generic payload receive error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBUEIE</name>
              <description>Payload buffer underflow error interrupt enable
This bit enables the interrupt generation on payload buffer underflow error.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0</name>
          <displayName>FIR0</displayName>
          <description>DSI Host force interrupt register 0</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAE0</name>
              <description>Force acknowledge error 0
Writing one to this bit forces an acknowledge error 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE1</name>
              <description>Force acknowledge error 1
Writing one to this bit forces an acknowledge error 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE2</name>
              <description>Force acknowledge error 2
Writing one to this bit forces an acknowledge error 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE3</name>
              <description>Force acknowledge error 3
Writing one to this bit forces an acknowledge error 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE4</name>
              <description>Force acknowledge error 4
Writing one to this bit forces an acknowledge error 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE5</name>
              <description>Force acknowledge error 5
Writing one to this bit forces an acknowledge error 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE6</name>
              <description>Force acknowledge error 6
Writing one to this bit forces an acknowledge error 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE7</name>
              <description>Force acknowledge error 7
Writing one to this bit forces an acknowledge error 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE8</name>
              <description>Force acknowledge error 8
Writing one to this bit forces an acknowledge error 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE9</name>
              <description>Force acknowledge error 9
Writing one to this bit forces an acknowledge error 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE10</name>
              <description>Force acknowledge error 10
Writing one to this bit forces an acknowledge error 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE11</name>
              <description>Force acknowledge error 11
Writing one to this bit forces an acknowledge error 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE12</name>
              <description>Force acknowledge error 12
Writing one to this bit forces an acknowledge error 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE13</name>
              <description>Force acknowledge error 13
Writing one to this bit forces an acknowledge error 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE14</name>
              <description>Force acknowledge error 14
Writing one to this bit forces an acknowledge error 14.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAE15</name>
              <description>Force acknowledge error 15
Writing one to this bit forces an acknowledge error 15.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FPE0</name>
              <description>Force PHY error 0
Writing one to this bit forces a PHY error 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FPE1</name>
              <description>Force PHY error 1
Writing one to this bit forces a PHY error 1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FPE2</name>
              <description>Force PHY error 2
Writing one to this bit forces a PHY error 2.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FPE3</name>
              <description>Force PHY error 3
Writing one to this bit forces a PHY error 3.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FPE4</name>
              <description>Force PHY error 4
Writing one to this bit forces a PHY error 4.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
