knieriem/tinygo-stm32-svd/svd/stm32u5a9.svd
        <register>
          <name>FIR1</name>
          <displayName>FIR1</displayName>
          <description>DSI Host force interrupt register 1</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FTOHSTX</name>
              <description>Force timeout high-speed transmission
Writing one to this bit forces a timeout high-speed transmission.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FTOLPRX</name>
              <description>Force timeout low-power reception
Writing one to this bit forces a timeout low-power reception.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FECCSE</name>
              <description>Force ECC single-bit error
Writing one to this bit forces a ECC single-bit error.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FECCME</name>
              <description>Force ECC multi-bit error
Writing one to this bit forces a ECC multi-bit error.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FCRCE</name>
              <description>Force CRC error
Writing one to this bit forces a CRC error.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FPSE</name>
              <description>Force packet size error
Writing one to this bit forces a packet size error.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FEOTPE</name>
              <description>Force EoTp error
Writing one to this bit forces a EoTp error.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLPWRE</name>
              <description>Force LTDC payload write error
Writing one to this bit forces a LTDC payload write error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FGCWRE</name>
              <description>Force generic command write error
Writing one to this bit forces a generic command write error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FGPWRE</name>
              <description>Force generic payload write error
Writing one to this bit forces a generic payload write error.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FGPTXE</name>
              <description>Force generic payload transmit error
Writing one to this bit forces a generic payload transmit error.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FGPRDE</name>
              <description>Force generic payload read error
Writing one to this bit forces a generic payload read error.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FGPRXE</name>
              <description>Force generic payload receive error
Writing one to this bit forces a generic payload receive error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FPBUE</name>
              <description>Force payload buffer underflow error
Writing one to this bit forces a payload undrflow error.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLTRCR</name>
          <displayName>DLTRCR</displayName>
          <description>DSI Host data lane timer read configuration register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MRD_TIME</name>
              <description>Maximum read time
This field configures the maximum time required to perform a read command in lane byte clock cycles. This register can only be modified when no read command is in progress.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VSCR</name>
          <displayName>VSCR</displayName>
          <description>DSI Host video shadow control register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable
When set to 1, DSI Host LTDC interface receives the active configuration from the auxiliary registers.
When this bit is set along with the UR bit, the auxiliary registers are automatically updated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UR</name>
              <description>Update register
When set to 1, the LTDC registers are copied to the auxiliary registers. After copying, this bit is auto cleared.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCVCIDR</name>
          <displayName>LCVCIDR</displayName>
          <description>DSI Host LTDC current VCID register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VCID</name>
              <description>Virtual channel ID
This field returns the virtual channel ID for the LTDC interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCCCR</name>
          <displayName>LCCCR</displayName>
          <description>DSI Host LTDC current color coding register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COLC</name>
              <description>Color coding
This field returns the current LTDC interface color coding.
0110-1111: reserved
If LTDC interface in command mode is chosen and currently works in the command mode (CMDM=1), then 0110-1111: 24-bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPE</name>
              <description>Loosely packed enable
This bit returns the current state of the loosely packed variant to 18-bit configurations.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMCCR</name>
          <displayName>LPMCCR</displayName>
          <description>DSI Host low-power mode current configuration register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VLPSIZE</name>
              <description>VACT largest packet size
This field returns the current size, in bytes, of the largest packet that can fit in a line during VACT regions, for the transmission of commands in low-power mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSIZE</name>
              <description>Largest packet size
This field is returns the current size, in bytes, of the largest packet that can fit in a line during VSA, VBP and VFP regions, for the transmission of commands in low-power mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMCCR</name>
          <displayName>VMCCR</displayName>
          <description>DSI Host video mode current configuration register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VMT</name>
              <description>Video mode type
This field returns the current video mode transmission type:
1x: Burst mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPVSAE</name>
              <description>Low-power vertical sync time enable
This bit returns the current state of return to low-power inside the vertical sync time (VSA) period when timing allows.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPVBPE</name>
              <description>Low-power vertical back-porch enable
This bit returns the current state of return to low-power inside the vertical back-porch (VBP) period when timing allows.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPVFPE</name>
              <description>Low-power vertical front-porch enable
This bit returns the current state of return to low-power inside the vertical front-porch (VFP) period when timing allows.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPVAE</name>
              <description>Low-power vertical active enable
This bit returns the current state of return to low-power inside the vertical active (VACT) period when timing allows.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPHBPE</name>
              <description>Low-power horizontal back-porch enable
This bit returns the current state of return to low-power inside the horizontal back-porch (HBP) period when timing allows.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPHFE</name>
              <description>Low-power horizontal front-porch enable
This bit returns the current state of return to low-power inside the horizontal front-porch (HFP) period when timing allows.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FBTAAE</name>
              <description>Frame BTA acknowledge enable
This bit returns the current state of request for an acknowledge response at the end of a frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCE</name>
              <description>Low-power command enable
This bit returns the current command transmission state in low-power mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VPCCR</name>
          <displayName>VPCCR</displayName>
          <description>DSI Host video packet current configuration register</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VPSIZE</name>
              <description>Video packet size
This field returns the number of pixels in a single video packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCCCR</name>
          <displayName>VCCCR</displayName>
          <description>DSI Host video chunks current configuration register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUMC</name>
              <description>Number of chunks
This field returns the number of chunks being transmitted during a line period.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VNPCCR</name>
          <displayName>VNPCCR</displayName>
          <description>DSI Host video null packet current configuration register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPSIZE</name>
              <description>Null packet size
This field returns the number of bytes inside a null packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VHSACCR</name>
          <displayName>VHSACCR</displayName>
          <description>DSI Host video HSA current configuration register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSA</name>
              <description>Horizontal synchronism active duration
This fields returns the horizontal synchronism active period in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VHBPCCR</name>
          <displayName>VHBPCCR</displayName>
          <description>DSI Host video HBP current configuration register</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HBP</name>
              <description>Horizontal back-porch duration
This field returns the horizontal back-porch period in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VLCCR</name>
          <displayName>VLCCR</displayName>
          <description>DSI Host video line current configuration register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HLINE</name>
              <description>Horizontal line duration
This field returns the current total of the horizontal line period (HSA+HBP+HACT+HFP) counted in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VVSACCR</name>
          <displayName>VVSACCR</displayName>
          <description>DSI Host video VSA current configuration register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSA</name>
              <description>Vertical synchronism active duration
This field returns the current vertical synchronism active period measured in number of horizontal lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VVBPCCR</name>
          <displayName>VVBPCCR</displayName>
          <description>DSI Host video VBP current configuration register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBP</name>
              <description>Vertical back-porch duration
This field returns the current vertical back-porch period measured in number of horizontal lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VVFPCCR</name>
          <displayName>VVFPCCR</displayName>
          <description>DSI Host video VFP current configuration register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VFP</name>
              <description>Vertical front-porch duration
This field returns the current vertical front-porch period measured in number of horizontal lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VVACCR</name>
          <displayName>VVACCR</displayName>
          <description>DSI Host video VA current configuration register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VA</name>
              <description>Vertical active duration
This field returns the current vertical active period measured in number of horizontal lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
